# **TITANIC SURVIVOR ANALYSIS**

In [ ]:
import pandas as pd
import numpy as np

# READING DATA USING PANDAS

We use pandas *read_csv* function to read the csv file in python and pandas *DataFrame* method to convert file into the data frame

In [ ]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape

(891, 12)

#  HANDLING NULL VALUES

The dataset may contain many rows and columns for which some values may be missing,we can't leave those missing values as it is.In such cases we have two options:

1.   Either drop the entire row or column.
2.  Fill the missing value with some appropriate value such as mean.

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**Seperating out the columns which have more than 35% of the values missing in the dataset.**

In [ ]:
drop_col = df.isnull().sum()[df.isnull().sum()>(35/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.036847 -0.077221 -0.369226  ... -0.308247 -0.189119  0.096067
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [ ]:
df[['Fare']].corr()

      Fare
Fare   1.0

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df.drop(drop_col.index, axis=1, inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

# Checking last elements of the DataFrame with .tail() method

There is also a method to see the see last n number of elements. The method is called *.tail()*.
The same rule is also applied here. If we leave the parentheses blank, it will be set as 5, if we write 25 inside of the parentheses, it will show the last 25 elements of the dataframe.

In [ ]:
df.tail(25)

     PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
866          867         1       2  ...     SC/PARIS 2149  13.8583         C
867          868         0       1  ...          PC 17590  50.4958         S
868          869         0       3  ...            345777   9.5000         S
869          870         1       3  ...            347742  11.1333         S
870          871         0       3  ...            349248   7.8958         S
871          872         1       1  ...             11751  52.5542         S
872          873         0       1  ...               695   5.0000         S
873          874         0       3  ...            345765   9.0000         S
874          875         1       2  ...         P/PP 3381  24.0000         C
875          876         1       3  ...              2667   7.2250         C
876          877         0       3  ...              7534   9.8458         S
877          878         0       3  ...            349212   7.8958         S
878          879         0       3  ...            349217   7.8958         S
879          880         1       1  ...             11767  83.1583         C
880          881         1       2  ...            230433  26.0000         S
881          882         0       3  ...            349257   7.8958         S
882          883         0       3  ...              7552  10.5167         S
883          884         0       2  ...  C.A./SOTON 34068  10.5000         S
884          885         0       3  ...   SOTON/OQ 392076   7.0500         S
885          886         0       3  ...            382652  29.1250         Q
886          887         0       2  ...            211536  13.0000         S
887          888         1       1  ...            112053  30.0000         S
888          889         0       3  ...        W./C. 6607  23.4500         S
889          890         1       1  ...            111369  30.0000         C
890          891         0       3  ...            370376   7.7500         Q

[25 rows x 11 columns]

# Reading a CSV file with specific columns

Use *usecols* argument to specify the column names that we want to work with.

In [ ]:
df = pd.read_csv("train (1).csv", usecols= ["PassengerId", "Survived", "Pclass"]) 
df.head()

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

Reading the whole data.

In [ ]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

# Getting some information about dataset with .describe() and .info()

**.describe() method**

This method is used to get a summary of numeric values in your dataset. It calculates the mean, standard deviation, minimum value, maximum value, 1st percentile, 2nd percentile, 3rd percentile of the columns with numeric values. It also counts the number of variables in the dataset. So, we will be able to see if there are missing values in columns.

In [ ]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

**.info() method**

This method prints information about a DataFrame including the index dtype and column dtypes, non-null values and memory usage.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

We can also see the data types of columns with *.dtypes*

In [ ]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# Sorting the DataFrame based on a column

**Sorting numeric data**

There is a column in our dataframe which represents the price of the ticket that passengers bought.To see lowest ticket price, we have to use .sort_values() method. It doesn’t matter if the column that you want to sort is string or numeric. If it includes letters, it will sort in alphabetical order.

In [ ]:
df.sort_values('Fare').head(10)

     PassengerId  Survived  Pclass  ... Fare Cabin  Embarked
271          272         1       3  ...  0.0   NaN         S
597          598         0       3  ...  0.0   NaN         S
302          303         0       3  ...  0.0   NaN         S
633          634         0       1  ...  0.0   NaN         S
277          278         0       2  ...  0.0   NaN         S
413          414         0       2  ...  0.0   NaN         S
674          675         0       2  ...  0.0   NaN         S
263          264         0       1  ...  0.0   B94         S
466          467         0       2  ...  0.0   NaN         S
732          733         0       2  ...  0.0   NaN         S

[10 rows x 12 columns]

We used .head() method to see only first 10 of the results after sorting.

**Sorting columns with strings**

To sort the “Cabin” column. There are lots of missing (NaN) values in this column.There is an argument which is called *na_position* which helps us to set a position for the NaN values in the dataset.

In [ ]:
df.sort_values("Cabin", ascending = True, na_position ='last').tail(20)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
865          866         1       2  ...  13.0000   NaN         S
866          867         1       2  ...  13.8583   NaN         C
868          869         0       3  ...   9.5000   NaN         S
869          870         1       3  ...  11.1333   NaN         S
870          871         0       3  ...   7.8958   NaN         S
873          874         0       3  ...   9.0000   NaN         S
874          875         1       2  ...  24.0000   NaN         C
875          876         1       3  ...   7.2250   NaN         C
876          877         0       3  ...   9.8458   NaN         S
877          878         0       3  ...   7.8958   NaN         S
878          879         0       3  ...   7.8958   NaN         S
880          881         1       2  ...  26.0000   NaN         S
881          882         0       3  ...   7.8958   NaN         S
882          883         0       3  ...  10.5167   NaN         S
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[20 rows x 12 columns]

By using .tail(20), we can see the last 20 elements of the dataset. If we look at Cabin column, we can see that all of the values are NaN.

**Using *value_counts()* to count the occurences of each variable in a column**

To count the occurence of a variable, we have to select the column first.

In [ ]:
df.Sex

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [ ]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

**Using *.nunique()* to count number of unique values that occur in dataset or in a column.**

To see number of unique records in a dataset or in a column, we have to use .nunique() method.

In [ ]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

We can also count the unique records with .nunique() for a column. All we have to do is add the column name.

In [ ]:
df[["Embarked", "Sex"]].nunique()

Embarked    3
Sex         2
dtype: int64

# **Changing the data type**

The type of Embarked column is object. After counting the unique values in Embarked column with .unique(), we can see that there are 3 unique values in that column. So we can consider that the data type should be categorical. To change the datatype of that column the code below must be executed:

In [ ]:
df["Embarked"] = df["Embarked"].astype("category")
df["Embarked"].dtype

CategoricalDtype(categories=['C', 'Q', 'S'], ordered=False)

# **Filtering**

The comparison sign in Python is == (double equal sign).To see if the “Embarked” column is equal to “C”.

In [ ]:
df["Embarked"] == "C"

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889     True
890    False
Name: Embarked, Length: 891, dtype: bool

**Filtering under two or more condition**

**AND Operator**

We are going to use AND and OR operator to filter with more than one condition. Let’s assume that we want to see the passengers whose Fare is smaller than 100 and who are female.

In [ ]:
df_fare_mask = df["Fare"] < 100
df_sex_mask = df["Sex"] == "female"
df[df_fare_mask & df_sex_mask]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
8              9         1       3  ...  11.1333   NaN         S
9             10         1       2  ...  30.0708   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
880          881         1       2  ...  26.0000   NaN         S
882          883         0       3  ...  10.5167   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S

[280 rows x 12 columns]

**OR Operator**

We are going to use | sign to do that. Let’s see the passengers whose fare is more than 500 or older than 70.

In [ ]:
df_fare_mask2 = df['Fare'] > 500
df_age_mask = df['Age'] > 70
df[df_fare_mask2 | df_age_mask]

     PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
96            97         0       1  ...   34.6542           A5         C
116          117         0       3  ...    7.7500          NaN         Q
258          259         1       1  ...  512.3292          NaN         C
493          494         0       1  ...   49.5042          NaN         C
630          631         1       1  ...   30.0000          A23         S
679          680         1       1  ...  512.3292  B51 B53 B55         C
737          738         1       1  ...  512.3292         B101         C
851          852         0       3  ...    7.7750          NaN         S

[8 rows x 12 columns]

# **CONCLUSION**



*   Female passengers were prioritized over men.
*   The hierarchy might have been followed while saving the passengers.People of high class or rich people have higher survival rate than others.
*   Passengers travelling with their family had higher survival rate.
*   Passengers who boarded at Cherboug,survived more in proportion than the others.